W7D3/super_goals/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "WOpp1VDXe4l-lqjCK9tA8w"], ["LIMIT", 1]]
---
    def current_user
        # debugger
        return nil unless session[:session_token]
        current_user ||= User.find_by(session_token: session[:session_token])