W8D1/reddit_clone/app/views/posts/edit.html.erb

    <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"
    <%= "checked".html_safe if @post.sub_ids.include?(sub.id) %>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 6]]