W8D1/reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "basketball"], ["url", "www.nba.com"], ["content", "I have the best team"], ["user_id", 1], ["created_at", "2019-12-02 23:55:26.513022"], ["updated_at", "2019-12-02 23:55:26.513022"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    # @post.sub_id = params[:sub_id]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"
---
  def edit
    @post = Post.find(params[:id])
    @subs = Sub.all

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
---
  def update
    @post = current_user.posts.find(params[:id])