W8D1/reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Hn8qqCXEGyRptAz16emQbw"], ["updated_at", "2019-12-02 19:18:13.783693"], ["id", 1]]
---
  def reset_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save