W6D5/cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "brown"], ["description", "Whateverdafaddsaf"], ["updated_at", "2019-11-23 00:12:22.976650"], ["id", 2]]