W8D1/reddit_clone/app/views/subs/show.erb


  <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]